lskrzypczak/ESP32-LED-Clock/src/main.cpp
/**
 * @file main.cpp
 * @brief Main firmware entry point for the ESP32 LED clock.
 *
 * Besides hardware initialization and task orchestration, this file owns the
 * persistent configuration that must survive reboots. The alarm persistence
 * helpers below are intentionally documented in detail because they define the
 * serialized format that both the runtime scheduler and the web API depend on.
 */

#include <Arduino.h>
#include <WiFi.h>
#include <WebServer.h>
#include <Preferences.h>
#include <freertos/FreeRTOS.h>
#include <freertos/task.h>
#include <freertos/semphr.h>
#include "PCF8574.h"
#include "ESP32_RTC.h"
#include "Digits5x8.h"
#include "CommonTypes.h"
#include "AlarmMelodies.h"
#include "WebServerHandlers.h"

// Default WiFi configuration
const char* DEFAULT_WIFI_SSID = "Your_AP";        // Replace with your WiFi SSID
const char* DEFAULT_WIFI_PASSWORD = "PASSWORD"; // Replace with your WiFi password

// Stored/persistent WiFi configuration (loaded from NVS)
String wifiSsid;
String wifiPassword;
Preferences prefs;

// Access Point configuration (fallback mode)
const char* AP_SSID = "LEDClock";
const char* AP_PASSWORD = "clock1234";  // Minimum 8 characters for WPA2

// Web server on port 80
WebServer server(80);

// Timezone configuration

const Timezone timezones[] = {
  {"UTC", "Coordinated Universal Time", 0, 0},
  {"CET", "Central European Time (UTC+1)", 3600, 3600},
  {"CEST", "Central European Summer Time (UTC+2)", 7200, 0},
  {"EST", "Eastern Standard Time (UTC-5)", -18000, 3600},
  {"EDT", "Eastern Daylight Time (UTC-4)", -14400, 0},
  {"PST", "Pacific Standard Time (UTC-8)", -28800, 3600},
  {"PDT", "Pacific Daylight Time (UTC-7)", -25200, 0},
  {"GMT", "Greenwich Mean Time", 0, 3600},
  {"BST", "British Summer Time (UTC+1)", 3600, 0},
  {"JST", "Japan Standard Time (UTC+9)", 32400, 0}
};

const int NUM_TIMEZONES = sizeof(timezones) / sizeof(timezones[0]);
int currentTimezoneIndex = 1;  // Default to CET (index 1)

// DST (Daylight Saving Time) configuration
DstMode dstMode = DST_AUTO;  // Default to automatic DST
int manualDstOffset = 0;     // Manual DST offset in seconds (0 = no DST, 3600 = +1 hour)

// Get effective DST offset based on current mode
int getEffectiveDstOffset() {
  if (dstMode == DST_AUTO) {
    return timezones[currentTimezoneIndex].dstOffset;
  } else {
    return manualDstOffset;
  }
}

// Get effective GMT offset (timezone base + manual adjustments if in manual mode)
int getEffectiveGmtOffset() {
  if (dstMode == DST_AUTO) {
    return timezones[currentTimezoneIndex].gmtOffset;
  } else {
    // In manual mode, use timezone base GMT + manual DST
    return timezones[currentTimezoneIndex].gmtOffset + manualDstOffset;
  }
}

/**
 * @brief Loads WiFi credentials from the `wifi` NVS namespace.
 *
 * Missing keys fall back to the compile-time defaults so a first boot still
 * has usable credentials or an AP placeholder.
 */
void loadWifiCredentials() {
  prefs.begin("wifi", true);
  wifiSsid = prefs.getString("ssid", DEFAULT_WIFI_SSID);
  wifiPassword = prefs.getString("pass", DEFAULT_WIFI_PASSWORD);
  prefs.end();
}

/**
 * @brief Stores WiFi credentials in the `wifi` NVS namespace.
 * @param ssid Station SSID to persist.
 * @param password Station password to persist.
 */
void saveWifiCredentials(const String &ssid, const String &password) {
  Serial.println("Saving WiFi credentials to NVS");
  Serial.print("SSID: ");
  Serial.println(ssid);
  Serial.print("Password length: ");
  Serial.println(password.length());
  prefs.begin("wifi", false);
  prefs.putString("ssid", ssid);
  prefs.putString("pass", password);
  prefs.end();
  wifiSsid = ssid;
  wifiPassword = password;
  Serial.println("Credentials saved to NVS and globals updated");
}

/**
 * @brief In-memory alarm table used by the scheduler and web UI.
 *
 * The array has a fixed maximum size to avoid heap allocations inside the
 * timing-critical scheduler path. Only the first `alarmCount` entries are
 * considered valid.
 */
AlarmConfig alarms[MAX_ALARMS];
/** @brief Number of populated entries currently stored in `alarms`. */
int alarmCount = 0;

/**
 * @brief Builds a fallback title when a persisted alarm has no usable label.
 * @param index Zero-based alarm index in the in-memory array.
 * @return A UI-friendly default label such as `Alarm 1`.
 */
static String defaultAlarmTitle(int index) {
  return "Alarm " + String(index + 1);
}

/**
 * @brief Reports whether a character can be written directly to the title field.
 *
 * Alarm records are serialized into a comma- and pipe-delimited string.
 * Unsafe characters must therefore be escaped before persistence, otherwise
 * they would be misinterpreted as field separators during the next load.
 *
 * @param c Candidate character from the alarm title.
 * @return `true` if the character can be stored without percent-encoding.
 */
static bool isUnreservedAlarmChar(char c) {
  return (c >= 'A' && c <= 'Z') ||
         (c >= 'a' && c <= 'z') ||
         (c >= '0' && c <= '9') ||
         c == '-' || c == '_' || c == '.' || c == '~' || c == ' ';
}

/**
 * @brief Percent-encodes an alarm title for compact string storage.
 * @param title Raw alarm title entered by the user.
 * @return Encoded title safe to place after the `schedule` field.
 *
 * @details
 * Alarm storage is intentionally compact: the entire alarm list is written to a
 * single NVS string using this record layout:
 * `enabled,hour,minute,sound,schedule,title|enabled,hour,...`
 *
 * Since commas separate fields and pipes separate records, the title must be
 * escaped before saving. This function keeps common readable characters as-is
 * and converts everything else to `%HH` form.
 */
static String encodeAlarmTitle(const String &title) {
  String encoded;
  encoded.reserve(title.length() * 3);

  for (size_t i = 0; i < title.length(); i++) {
    char c = title[i];
    if (isUnreservedAlarmChar(c)) {
      encoded += c;
    } else {
      char buf[4];
      snprintf(buf, sizeof(buf), "%%%02X", static_cast<unsigned char>(c));
      encoded += buf;
    }
  }

  return encoded;
}

/**
 * @brief Converts one hexadecimal digit to an integer.
 * @param c ASCII hex digit.
 * @return The nibble value, or `-1` for invalid input.
 */
static int fromHexDigit(char c) {
  if (c >= '0' && c <= '9') return c - '0';
  if (c >= 'A' && c <= 'F') return c - 'A' + 10;
  if (c >= 'a' && c <= 'f') return c - 'a' + 10;
  return -1;
}

/**
 * @brief Decodes a persisted alarm title back to plain text.
 * @param encoded Percent-encoded title stored in NVS or submitted by the UI.
 * @return Decoded, trimmed title text.
 *
 * @details
 * The loader accepts titles in encoded form because the persistence and API
 * layers share the same compact record format. Trimming the result prevents
 * titles that contain only whitespace from surviving as visually empty labels.
 */
static String decodeAlarmTitle(const String &encoded) {
  String decoded;
  decoded.reserve(encoded.length());

