lskrzypczak/ESP32-LED-Clock/src/main.cpp
  for (size_t i = 0; i < encoded.length(); i++) {
    char c = encoded[i];
    if (c == '%' && i + 2 < encoded.length()) {
      int hi = fromHexDigit(encoded[i + 1]);
      int lo = fromHexDigit(encoded[i + 2]);
      if (hi >= 0 && lo >= 0) {
        decoded += static_cast<char>((hi << 4) | lo);
        i += 2;
        continue;
      }
    }
    decoded += c;
  }

  decoded.trim();
  return decoded;
}

/**
 * @brief Loads alarm records from the `alarm/alarms` NVS key.
 *
 * @details
 * The stored value is a single compact string that contains up to
 * `MAX_ALARMS` pipe-separated records. The current format is:
 * `enabled,hour,minute,sound,schedule,title`
 *
 * Example:
 * `1,7,30,2,1,Weekday%20Wakeup|0,9,0,1,2,Weekend`
 *
 * Malformed or out-of-range records are skipped instead of partially loaded.
 *
 * The parser is deliberately strict on numeric ranges because the scheduler
 * later assumes normalized values.
 */
void loadAlarms() {
  prefs.begin("alarm", true);
  String encoded = prefs.getString("alarms", "");
  prefs.end();

  alarmCount = 0;
  if (encoded.length() == 0) {
    return;
  }

  // Parse one pipe-delimited alarm record at a time so malformed entries can
  // be skipped without discarding the entire persisted payload.
  int start = 0;
  while (start < encoded.length() && alarmCount < MAX_ALARMS) {
    int sep = encoded.indexOf('|', start);
    if (sep < 0) sep = encoded.length();
    String chunk = encoded.substring(start, sep);

    int p0 = chunk.indexOf(',');
    int p1 = (p0 >= 0) ? chunk.indexOf(',', p0 + 1) : -1;
    int p2 = (p1 >= 0) ? chunk.indexOf(',', p1 + 1) : -1;
    int p3 = (p2 >= 0) ? chunk.indexOf(',', p2 + 1) : -1;
    int p4 = (p3 >= 0) ? chunk.indexOf(',', p3 + 1) : -1;

    if (p0 >= 0 && p1 >= 0 && p2 >= 0 && p3 >= 0 && p4 >= 0) {
      bool enabled = chunk.substring(0, p0) == "1";
      uint8_t hour = chunk.substring(p0 + 1, p1).toInt();
      uint8_t minute = chunk.substring(p1 + 1, p2).toInt();
      uint8_t sound = chunk.substring(p2 + 1, p3).toInt();
      uint8_t schedule = chunk.substring(p3 + 1, p4).toInt();
      String title = decodeAlarmTitle(chunk.substring(p4 + 1));

      if (hour < 24 && minute < 60 && sound < ALARM_SOUND_COUNT && schedule < ALARM_SCHEDULE_COUNT) {
        if (title.length() == 0) {
          title = defaultAlarmTitle(alarmCount);
        }
        // Only fully validated records are admitted into the runtime array.
        // This keeps the scheduler logic simple and protects against corrupt
        // NVS data or partially edited payloads.
        alarms[alarmCount++] = {enabled, hour, minute, sound, schedule, title};
      }
    }

    start = sep + 1;
  }
}

/**
 * @brief Serializes the current alarm table into the `alarm/alarms` NVS key.
 *
 * @details
 * The implementation writes all alarms as one string instead of separate keys.
 * That keeps reads and writes simple and stable:
 * - records are emitted in UI/scheduler order,
 * - fields stay positional,
 * - titles are percent-encoded to protect delimiters,
 * - empty alarm slots beyond `alarmCount` are omitted entirely.
 *
 * The resulting format is human-readable enough for serial debugging while
 * remaining compact for NVS storage.
 */
void saveAlarms() {
  String encoded;
  for (int i = 0; i < alarmCount; i++) {
    if (i > 0) encoded += '|';
    encoded += alarms[i].enabled ? '1' : '0';
    encoded += ',';
    encoded += String(alarms[i].hour);
    encoded += ',';
    encoded += String(alarms[i].minute);
    encoded += ',';
    encoded += String(alarms[i].sound);
    encoded += ',';
    encoded += String(alarms[i].schedule);
    encoded += ',';
    encoded += encodeAlarmTitle(alarms[i].title);
  }

  prefs.begin("alarm", false);
  prefs.putString("alarms", encoded);
  prefs.end();
}

// WiFi mode tracking
bool wifiModeAP = false;  // true if running as Access Point, false if connected to external WiFi

// Pin definitions
#define BUZZER_PIN 20
#define DP_LED_PIN 10

// Buzzer timer configuration
#define BUZZER_CHANNEL 0
#define BUZZER_FREQUENCY 1000  // 1kHz
#define BUZZER_RESOLUTION 8    // 8-bit resolution
#define BUZZER_DUTY_CYCLE 128  // 50% duty cycle (128/256)

// I2C expander addresses
#define PCF8574N_ADDR_0 0x20  // A0=GND, A1=GND, A2=GND
#define PCF8574N_ADDR_1 0x21  // A0=VCC, A1=GND, A2=GND
#define PCF8574N_ADDR_2 0x22  // A0=GND, A1=VCC, A2=GND
#define PCF8574N_ADDR_3 0x23  // A0=VCC, A1=VCC, A2=GND
#define PCF8574N_ADDR_4 0x24  // A0=GND, A1=GND, A2=VCC

// Create PCF8574N instances with default addresses (adjust as needed)
PCF8574 expander_0(PCF8574N_ADDR_0, &Wire);
PCF8574 expander_1(PCF8574N_ADDR_1, &Wire);
PCF8574 expander_2(PCF8574N_ADDR_2, &Wire);
PCF8574 expander_3(PCF8574N_ADDR_3, &Wire);
PCF8574 expander_4(PCF8574N_ADDR_4, &Wire);

// Create ESP32 RTC instance
ESP32RTC rtc;

// Array of bytes representing time digits (0-9), 7 rows per digit
// This will be used to display time on the LED matrix
// Each byte represents a row of 5 pixels (bits 0-4), bits 5-7 are unused
// For example, digit '0' might look like this:
// 0b01110,  // Row 0: .###.
// 0b10001,  // Row 1: #...#
// 0b10001,  // Row 2: #...#
// 0b10001,  // Row 3: #...#
// 0b10001,  // Row 4: #...#
// 0b10001,  // Row 5: #...#
// 0b01110   // Row 6: .###.
// The actual bitmaps for digits 0-9 are defined in Digits5x8.cpp

// Array to store current time display (4 digits)
// Each element stores a pointer to the 8-byte bitmap for that digit
const uint8_t* timeDisplay[4] = {nullptr, nullptr, nullptr, nullptr};
uint8_t currentRow = 0; // Track current row being updated on the display
uint8_t rowPinValue = 0x01;

// Digit animation state
uint8_t currentDigits[4] = {0, 0, 0, 0};
uint8_t nextDigits[4] = {0, 0, 0, 0};
uint8_t animStep[4] = {DIGIT_HEIGHT, DIGIT_HEIGHT, DIGIT_HEIGHT, DIGIT_HEIGHT};
uint8_t animDelay[4] = {0, 0, 0, 0};
unsigned long lastAnimMillis = 0;
const unsigned long ANIM_STEP_MS = 80; // Animation frame duration in ms
const uint8_t ANIM_DELAY_STEPS = 2; // How many animation frames between each digit start

// Alarm state tracking
bool alarmTriggered[MAX_ALARMS] = {false};
int lastAlarmMinute = -1;

// RTOS mutex for protecting shared digit data
SemaphoreHandle_t digitMutex;

// Task handles
TaskHandle_t webServerTaskHandle;
TaskHandle_t timeAlarmTaskHandle;
TaskHandle_t animationTaskHandle;
TaskHandle_t displayTaskHandle;
TaskHandle_t heartbeatTaskHandle;

bool isAlarmScheduledForToday(uint8_t schedule, uint8_t dayOfWeek) {
  bool isWeekend = (dayOfWeek == 0 || dayOfWeek == 6);

  switch (schedule) {
    case ALARM_SCHEDULE_WEEKDAYS:
      return !isWeekend;
    case ALARM_SCHEDULE_WEEKENDS:
      return isWeekend;
    case ALARM_SCHEDULE_DAILY:
    default:
      return true;
  }
}

// Helper: return the row bytes for a digit position, applying slide-up animation when active
uint8_t getDigitRow(uint8_t pos, uint8_t row) {
  // If no active animation, just return the current digit row
  if (animStep[pos] >= DIGIT_HEIGHT) {
    return Digits5x8::getDigit(currentDigits[pos])[row];
  }

  const uint8_t* oldBmp = Digits5x8::getDigit(currentDigits[pos]);
  const uint8_t* newBmp = Digits5x8::getDigit(nextDigits[pos]);
  uint8_t t = animStep[pos];

  if (row + t < DIGIT_HEIGHT) {
    return oldBmp[row + t];
  }

