lskrzypczak/ESP32-LED-Clock/src/main.cpp
  uint8_t newRow = row - (DIGIT_HEIGHT - t);
  if (newRow < DIGIT_HEIGHT) {
    return newBmp[newRow];
  }

  return 0;
}

// Buzzer control functions
void buzzerOn() {
  ledcWrite(BUZZER_CHANNEL, BUZZER_DUTY_CYCLE);
}

void buzzerOff() {
  ledcWrite(BUZZER_CHANNEL, 0);
}

void playNote(unsigned int frequency, unsigned long duration) {
  if (frequency == 0) {
    buzzerOff();
    delay(duration);
  } else {
    ledcWriteTone(BUZZER_CHANNEL, frequency);
    ledcWrite(BUZZER_CHANNEL, BUZZER_DUTY_CYCLE);
    delay(duration);
    buzzerOff();
  }
}

void playSiren() {
  // Short siren sound for WiFi fallback activation
  // Rising siren: 800Hz to 1200Hz
  for (int freq = 800; freq <= 1200; freq += 50) {
    ledcWriteTone(BUZZER_CHANNEL, freq);
    ledcWrite(BUZZER_CHANNEL, BUZZER_DUTY_CYCLE);
    delay(30);
  }
  // Falling siren: 1200Hz to 800Hz
  for (int freq = 1200; freq >= 800; freq -= 50) {
    ledcWriteTone(BUZZER_CHANNEL, freq);
    ledcWrite(BUZZER_CHANNEL, BUZZER_DUTY_CYCLE);
    delay(30);
  }
  buzzerOff();
}

void beep(int count = 1) {
  for (int i = 0; i < count; i++) {
    playNote(1000, 100); // Beep at 1kHz for 100ms
    delay(100);
  }
}

void shortBeep() {
  playNote(1000, 10); // Beep at 1kHz for 100ms
  delay(100);
}

void playAlarmSound(uint8_t sound) {
  switch (sound) {
    case ALARM_SOUND_BEEP:
      playNote(1000, 200);
      delay(100);
      playNote(1000, 200);
      delay(100);
      playNote(1000, 200);
      break;
    case ALARM_SOUND_FANFARE:
    case ALARM_SOUND_NOKIA:
    case ALARM_SOUND_SMS:
    case ALARM_SOUND_MOTOROLA:
    case ALARM_SOUND_SIEMENS:
      playAlarmMelody(sound);
      break;
    case ALARM_SOUND_SIREN:
    default:
      playSiren();
      break;
  }
}

// WiFi connection function with AP fallback
bool connectToWiFi() {
  Serial.println("Attempting to connect to WiFi network...");

  // Ensure we have credentials loaded (fallback to defaults if not)
  if (wifiSsid.length() == 0) wifiSsid = DEFAULT_WIFI_SSID;
  if (wifiPassword.length() == 0) wifiPassword = DEFAULT_WIFI_PASSWORD;

  Serial.print("Using SSID: ");
  Serial.println(wifiSsid);
  Serial.print("Using Password: ");
  Serial.println(wifiPassword.length() > 0 ? "[hidden]" : "[empty]");

  WiFi.begin(wifiSsid.c_str(), wifiPassword.c_str());

  int attempts = 0;
  while (WiFi.status() != WL_CONNECTED && attempts < 20) { // 20 attempts = ~10 seconds
    delay(400);
    shortBeep();
    Serial.print(".");
    attempts++;
  }
  
  if (WiFi.status() == WL_CONNECTED) {
    Serial.println("\nWiFi connected to network!");
    Serial.print("IP address: ");
    Serial.println(WiFi.localIP());
    wifiModeAP = false;
    return true;
  } else {
    Serial.println("\nWiFi network connection failed!");
    Serial.println("Starting Access Point mode as fallback...");

    WiFi.disconnect(true);
    delay(500);
    
    // Start Access Point mode
    WiFi.mode(WIFI_AP);
    if (WiFi.softAP(AP_SSID, /*AP_PASSWORD*/NULL, 13, false, 4)) {
      Serial.println("Access Point started successfully!");
      Serial.print("AP SSID: ");
      Serial.println(AP_SSID);
      Serial.print("AP IP address: ");
      Serial.println(WiFi.softAPIP());
      wifiModeAP = true;
      playSiren();  // Play siren sound to indicate AP fallback mode
      return true;
    } else {
      Serial.println("Failed to start Access Point!");
      wifiModeAP = false;
      return false;
    }
  }
}

// Web server setup function
void setupWebServer() {
  Serial.println("Setting up web server routes");
  server.on("/", handleRoot);
  server.on("/favicon.ico", HTTP_GET, handleFavicon);
  server.on("/api/status", HTTP_GET, handleApiStatus);
  server.on("/api/settime", HTTP_POST, handleApiSetTime);
  server.on("/api/wifi", HTTP_POST, handleApiWifi);
  server.on("/api/timezone", HTTP_POST, handleApiTimezone);
  server.on("/api/alarms", HTTP_POST, handleApiAlarms);
  server.on("/api/alarm/test", HTTP_POST, handleApiAlarmTest);
  server.onNotFound(handleNotFound);
  Serial.println("Web server routes registered");
}

// RTOS Task Functions
void webServerTask(void *pvParameters) {
  while (true) {
    server.handleClient();
    vTaskDelay(1 / portTICK_PERIOD_MS); // Small delay to yield
  }
}

void timeAlarmTask(void *pvParameters) {
  while (true) {
    DateTime now = rtc.now();

    char timeStr[9];
    rtc.getTimeString(timeStr);

    // Calculate new digit values and start animation where digits changed
    uint8_t newDigits[4] = {
      (uint8_t)(now.hour / 10),
      (uint8_t)(now.hour % 10),
      (uint8_t)(now.minute / 10),
      (uint8_t)(now.minute % 10)
    };

    xSemaphoreTake(digitMutex, portMAX_DELAY);
    for (int i = 0; i < 4; i++) {
      if (newDigits[i] != nextDigits[i]) {
        // Start animation for this digit (cascade with delay)
        currentDigits[i] = nextDigits[i];
        nextDigits[i] = newDigits[i];
        animStep[i] = 0;
        animDelay[i] = i * ANIM_DELAY_STEPS; // cascade delay based on digit position
      }
    }
    xSemaphoreGive(digitMutex);

    // Check alarms once per minute and trigger those that match
    int currentMinute = now.minute;
    if (currentMinute != lastAlarmMinute) {
      lastAlarmMinute = currentMinute;
      for (int i = 0; i < alarmCount; i++) {
        alarmTriggered[i] = false;
      }
    }

    for (int i = 0; i < alarmCount; i++) {
      if (!alarmTriggered[i] &&
          alarms[i].enabled &&
          isAlarmScheduledForToday(alarms[i].schedule, now.dayOfWeek) &&
          now.hour == alarms[i].hour &&
          now.minute == alarms[i].minute) {
        alarmTriggered[i] = true;
        playAlarmSound(alarms[i].sound);
      }
    }

    vTaskDelay(1000 / portTICK_PERIOD_MS);
  }
}

void animationTask(void *pvParameters) {
  while (true) {
    xSemaphoreTake(digitMutex, portMAX_DELAY);
    for (int i = 0; i < 4; i++) {
      if (animStep[i] < DIGIT_HEIGHT) {
        if (animDelay[i] > 0) {
          animDelay[i]--;
          continue;
        }
        animStep[i]++;
        if (animStep[i] >= DIGIT_HEIGHT) {
          // Animation finished: commit the new digit
          currentDigits[i] = nextDigits[i];
          animStep[i] = DIGIT_HEIGHT;
        }
      }
    }
    xSemaphoreGive(digitMutex);

    vTaskDelay(ANIM_STEP_MS / portTICK_PERIOD_MS);
  }
}

void displayTask(void *pvParameters) {
  while (true) {
    xSemaphoreTake(digitMutex, portMAX_DELAY);
    // Set expanders 1-4 to the values from the display array. Each digit is one expander. Low is active.
    expander_0.write8(0x00); // Row control pins (active LOW)
    expander_1.write8(~getDigitRow(0, currentRow)); // Digit 0
    expander_2.write8(~getDigitRow(1, currentRow)); // Digit 1
    expander_3.write8(~getDigitRow(2, currentRow)); // Digit 2
    expander_4.write8(~getDigitRow(3, currentRow)); // Digit 3
    expander_0.write8(rowPinValue);
    xSemaphoreGive(digitMutex);

