lskrzypczak/ESP32-LED-Clock/src/main.cpp
    rowPinValue <<= 1;
    if (rowPinValue == 0x80) {
      rowPinValue = 0x00; // After the last row, set to 0 to turn off all rows before resetting to 0x01
    }
    currentRow++;
    if (currentRow >= DIGIT_HEIGHT) {
      currentRow = 0;
      rowPinValue = 0x01;
    }

    vTaskDelay(1 / portTICK_PERIOD_MS); // Fast update
  }
}

void heartbeatTask(void *pvParameters) {
  bool ledState = false;
  while (true) {
    digitalWrite(DP_LED_PIN, ledState ? LOW : HIGH);
    ledState = !ledState;
    vTaskDelay(500 / portTICK_PERIOD_MS);
  }
}

void setup() {
  // Initialize serial for debugging
  Serial.begin(115200);
  delay(1000);
  
  // Setup GPIO
  pinMode(BUZZER_PIN, OUTPUT_OPEN_DRAIN);
  digitalWrite(BUZZER_PIN, HIGH);  // Buzzer off (active LOW)
  pinMode(DP_LED_PIN, OUTPUT_OPEN_DRAIN);
  digitalWrite(DP_LED_PIN, HIGH);  // DP LED off

  // Setup buzzer timer
  ledcSetup(BUZZER_CHANNEL, BUZZER_FREQUENCY, BUZZER_RESOLUTION);
  ledcAttachPin(BUZZER_PIN, BUZZER_CHANNEL);

  delay(1000);  // Wait for peripherals to stabilize
  beep(1);    // Short beep to indicate startup
  
  // Load saved WiFi credentials (if any)
  loadWifiCredentials();

  // Load saved alarm settings (if any)
  loadAlarms();

  // Connect to WiFi
  if (connectToWiFi()) {
    // Setup web server routes
    setupWebServer();
    server.begin();
    Serial.println("Web server started");
    if (wifiModeAP) {
      Serial.print("AP IP: ");
      Serial.println(WiFi.softAPIP());
    } else {
      Serial.print("Station IP: ");
      Serial.println(WiFi.localIP());
    }
    
    // Sync time with NTP only if connected to external network (not AP mode)
    if (!wifiModeAP) {
      Serial.println("Syncing time with NTP...");
      if (rtc.syncNTP("pool.ntp.org", getEffectiveGmtOffset(), 0)) {
        Serial.println("NTP sync successful!");
        playFanfare();
      } else {
        Serial.println("NTP sync failed, using current RTC time");
        beep(2);
      }
    } else {
      Serial.println("In AP mode - NTP sync not available. Use web interface to set time manually.");
      beep(2);
    }
  } else {
    Serial.println("WiFi connection failed, continuing without network features");
    beep(3);
  }
  
  // configure global Wire object for ESP32-C3 I2C pins SDA=GPIO9, SCL=GPIO8
  Wire.begin(8, 9); // SCL=GPIO9, SDA=GPIO8
  Wire.setClock(100000); // Set I2C clock frequency to 100kHz (standard mode)
  
  // Initialize I2C expanders and check connectivity
  bool allConnected = true;
  allConnected &= expander_0.begin();
  allConnected &= expander_1.begin();
  allConnected &= expander_2.begin();
  allConnected &= expander_3.begin();
  allConnected &= expander_4.begin();
  if (!allConnected) {
    beep(4);
    while(1);
  }
  
  // Initialize internal ESP32 RTC with current timezone
  if (!rtc.begin(getEffectiveGmtOffset() / 3600)) {  // Convert seconds to hours
    beep(5);
    while(1);
  }

  // Initialize display digits with current time (no animation on startup)
  {
    DateTime now = rtc.now();
    currentDigits[0] = now.hour / 10;
    currentDigits[1] = now.hour % 10;
    currentDigits[2] = now.minute / 10;
    currentDigits[3] = now.minute % 10;
    for (int i = 0; i < 4; i++) {
      nextDigits[i] = currentDigits[i];
      animStep[i] = DIGIT_HEIGHT;
    }
  }
  
  // Set RTC time manually if NTP failed (uncomment to set manually)
  // rtc.setDateTime(2026, 3, 12, 12, 0, 0);  // year, month, day, hour, min, sec
  
  // Set all expander_0 pins to LOW and other expanders to HIGH
  expander_0.write8(0x00); // All pins LOW
  expander_1.write8(0xFF); // All pins HIGH
  expander_2.write8(0xFF); // All pins HIGH
  expander_3.write8(0xFF); // All pins HIGH
  expander_4.write8(0xFF); // All pins HIGH

  // Initialize RTOS mutex
  digitMutex = xSemaphoreCreateMutex();

  // Create RTOS tasks
  xTaskCreate(webServerTask, "WebServer", 4096, NULL, 4, &webServerTaskHandle);
  xTaskCreate(timeAlarmTask, "TimeAlarm", 2048, NULL, 2, &timeAlarmTaskHandle);
  xTaskCreate(animationTask, "Animation", 1024, NULL, 2, &animationTaskHandle);
  xTaskCreate(displayTask, "Display", 1024, NULL, 3, &displayTaskHandle);
  xTaskCreate(heartbeatTask, "Heartbeat", 512, NULL, 1, &heartbeatTaskHandle);

  Serial.println("RTOS tasks created");
}

void loop() {
  // All functionality moved to RTOS tasks
  vTaskDelay(portMAX_DELAY); // Suspend this task
}
